rkz/extension/Documents/ЗаданиеНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаданиеНаПеревозку</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Паспорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПриобретениеУслугПеревозки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВремяРейсаФактПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КурьерЭкспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаданийНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВремяРейсаПланПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВремяРейсаПланС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВремяРейсаФактС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоПунктов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаданиеВыполняет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИсполнителейЗаданийНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Маршрут</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Зона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

rkz/extension/Enums/ТипыИсполнителейЗаданийНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыИсполнителейЗаданийНаПеревозку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НашаТранспортнаяСлужба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Перевозчик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

rkz/extension/Documents/ЗаданиеНаПеревозку/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [22]  [AVZhelansky@1cbit.ru] [14.06.2024 8:00:00] + 	
	НовыйЭлемент = Элементы.Вставить("бит_СуммаОплаты", Тип("ПолеФормы"), Элементы.ГруппаДополнительныеРеквизиты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_СуммаОплаты";  
	
	НовыйЭлемент = Элементы.Вставить("бит_Паспорт", Тип("ПолеФормы"), Элементы.ГруппаВодитель);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Паспорт"; 
	
	НовыйЭлемент = Элементы.Вставить("бит_Телефон", Тип("ПолеФормы"), Элементы.ГруппаВодитель);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Телефон"; 
	
	// {{ПервыйБИТ ЛистТребований [22]  [AVZhelansky@1cbit.ru] [14.06.2024 8:00:00] - 
	
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [25.06.2024] +
	НовыйЭлемент = Элементы.Вставить("бит_ПриобретениеУслугПеревозки", Тип("ПолеФормы"), Элементы.ГруппаПраво);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ПриобретениеУслугПеревозки"; 
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_ПриобретениеУслугПеревозкиПриИзмененииНаКлиенте");
	
	НовыйЭлемент = Элементы.Добавить("бит_ГруппаОплата", Тип("ГруппаФормы"), Элементы.ГруппаПраво);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь; 
	НовыйЭлемент.Объединенная = Истина ;
	НовыйЭлемент.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	
	НовыйЭлемент = Элементы.Вставить("бит_ЗаголовокОплата", Тип("ДекорацияФормы"), Элементы.бит_ГруппаОплата);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = "(бит) Оплата";  
	НовыйЭлемент.Ширина = 22;  
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("бит_ДекорацияСостояниеРасчетов", Тип("ДекорацияФормы"), Элементы.бит_ГруппаОплата);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.УстановитьДействие("Нажатие", "бит_ДекорацияСостояниеРасчетовНажатиеНаКлиенте"); 
	
	бит_ОбновитьТекстГиперссылкиСостояниеРасчетов();
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [25.06.2024] - 
	
	
КонецПроцедуры  

&НаСервере
Процедура бит_ОбновитьТекстГиперссылкиСостояниеРасчетов() 
	
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [26.06.2024] + 
	ЭлементНадписьРасчеты = ЭтаФорма.Элементы.бит_ДекорацияСостояниеРасчетов;
	
	Если ЗначениеЗаполнено(Объект.бит_ПриобретениеУслугПеревозки) Тогда
		
		ДокументПриобретения = Объект.бит_ПриобретениеУслугПеревозки;
		ВалютаВзаиморасчетов  = ДокументПриобретения.ВалютаВзаиморасчетов;
		ЭлементНадписьРасчеты = ЭтаФорма.Элементы.бит_ДекорацияСостояниеРасчетов; 
		
		ТекстПредупреждения = "";
		Если НЕ ВзаиморасчетыСервер.ОтложенноеОбновлениеРегистровВзаиморасчетовЗавершено() Тогда
			ТекстПредупреждения = НСтр("ru = 'Данные могут быть неточными, выполняется обновление ИБ.';
			|en = 'The data might be inaccurate. Updating the infobase.'");
		КонецЕсли;
		
		СостояниеВзаиморасчетов = бит_СостояниеВзаиморасчетов(ДокументПриобретения);
		СуммаОплат   = Макс(0, СостояниеВзаиморасчетов.СуммаОплат);
		ПроцентОплат = Макс(0, бит_ОкруглитьПроценты(СостояниеВзаиморасчетов.ПроцентОплат));
		
		ЭлементНадписьРасчеты.Заголовок = НСтр("ru = 'Оплачено';
		|en = 'Amount paid'") + ": " + Формат(СуммаОплат, "ЧДЦ=2; ЧН=") + " " + ВалютаВзаиморасчетов + " " + ПроцентОплат + "%"
		+ ?(ПустаяСтрока(ТекстПредупреждения), "", " ") + ТекстПредупреждения; 
		
	Иначе
		
		ЭлементНадписьРасчеты.Заголовок = НСтр("ru = 'Оплачено';
		|en = 'Amount paid'") + ": 0.00 руб. 0%";
		
	КонецЕсли;
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [26.06.2024] -
	
КонецПроцедуры  

&НаСервере
Функция бит_СостояниеВзаиморасчетов(ДокументПриобретения) 
	
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [26.06.2024] +
	СуммаВзаиморасчетов = ?(ДокументПриобретения.СуммаВзаиморасчетов = 0 ,ДокументПриобретения.СуммаДокумента, ДокументПриобретения.СуммаВзаиморасчетов);
	Организация         = ДокументПриобретения.Организация;
	ТипРасчетов         = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
	ПорядокРасчетов     = ДокументПриобретения.ПорядокРасчетов;
	
	ОбъектРасчетов = ДокументПриобретения.ОбъектРасчетов;
	Если ТипЗнч(ОбъектРасчетов) = Тип("Массив") Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ОбъектРасчетов, ПредопределенноеЗначение("Справочник.ОбъектыРасчетов.ПустаяСсылка"));
		ОбъектРасчетов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ОбъектРасчетов);
		Если ОбъектРасчетов.Количество() = 1 Тогда
			ОбъектРасчетов = ОбъектРасчетов[0];
			СуммаВзаиморасчетов = 0;
		Иначе
			ОбъектРасчетов = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВзаиморасчетыСервер.СостояниеВзаиморасчетовОбъектаРасчетов(ОбъектРасчетов, СуммаВзаиморасчетов, ТипРасчетов, Организация, Ложь, Ложь);
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [26.06.2024] - 
	
КонецФункции 

&НаСервере
Функция бит_ОкруглитьПроценты(ОкругляемоеЧисло)
	
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [26.06.2024] +
	Если ОкругляемоеЧисло > 99
		И ОкругляемоеЧисло < 100 Тогда
		Результат = 99;
	ИначеЕсли ОкругляемоеЧисло > 0
		И ОкругляемоеЧисло < 1 Тогда
		Результат = 1;
	Иначе
		Результат = Окр(ОкругляемоеЧисло);
	КонецЕсли;
	
	Возврат Результат; 
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [26.06.2024] -
	
КонецФункции

&НаКлиенте
Процедура бит_ПриобретениеУслугПеревозкиПриИзмененииНаКлиенте()
	
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [26.06.2024] + 
	бит_ОбновитьТекстГиперссылкиСостояниеРасчетов();
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [26.06.2024] - 
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ДекорацияСостояниеРасчетовНажатиеНаКлиенте(Элемент, СтандартнаяОбработка)
	
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [26.06.2024] + 
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = бит_ПолучитьСтруктуруПараметровРасчетов();
	
	Если Не СтруктураПараметров = Неопределено Тогда
		ВзаиморасчетыКлиентСервер.ПроверитьОбязательныеПараметры(СтруктураПараметров,
		"Дата, ВалютаДокумента, Договор, СуммаДокумента");
		
		ПараметрОтчета = СтруктураПараметров.ОбъектРасчетов;
		
		Если ТипЗнч(ПараметрОтчета) = Тип("Массив") Тогда
			ПараметрОтчета = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ПараметрОтчета);
			Если ПараметрОтчета.Количество() = 1 Тогда
				ПараметрОтчета = ПараметрОтчета[0];
			КонецЕсли;
		КонецЕсли;
		
		ОтчетыУТКлиентПереопределяемый.ОткрытьОтчетКарточкаРасчетовСПоставщиками("КарточкаРасчетовСПоставщикамиПоДокументамКонтекст", ПараметрОтчета);
	КонецЕсли;
    // ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [26.06.2024] -
	
КонецПроцедуры	

&НаСервере
Функция бит_ПолучитьСтруктуруПараметровРасчетов()
	
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [26.06.2024] + 
	Если ЗначениеЗаполнено(Объект.бит_ПриобретениеУслугПеревозки) Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Дата", Объект.бит_ПриобретениеУслугПеревозки.Дата);
		СтруктураПараметров.Вставить("ВалютаДокумента", Объект.бит_ПриобретениеУслугПеревозки.Валюта); 
		СтруктураПараметров.Вставить("Договор", Объект.бит_ПриобретениеУслугПеревозки.Договор); 
		СтруктураПараметров.Вставить("СуммаДокумента", Объект.бит_ПриобретениеУслугПеревозки.СуммаДокумента);
		СтруктураПараметров.Вставить("ОбъектРасчетов", Объект.бит_ПриобретениеУслугПеревозки.Ссылка);
		
		Возврат СтруктураПараметров;  
		
	Иначе   
		
		Возврат Неопределено;  
		
	КонецЕсли;
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [26.06.2024] - 

КонецФункции

&НаСервере
&Вместо("НастроитьПоТипуИсполнителя")
Процедура бит_НастроитьПоТипуИсполнителя()
	ВыполняетПеревозчик = Объект.ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик;
	
	Элементы.Перевозчик.Видимость             = ВыполняетПеревозчик;
	Элементы.Водитель.Видимость               = Не ВыполняетПеревозчик;
	Элементы.КурьерЭкспедитор.Видимость       = Не ВыполняетПеревозчик;	
	// {{ПервыйБИТ ЛистТребований [22]  [AVZhelansky@1cbit.ru] [16.06.2024 10:00:00] Удаление типового кода + 	
	//Элементы.ИнформацияОТСИВодителе.Видимость = ВыполняетПеревозчик
	//											И Объект.Операция = Перечисления.ВидыДоставки.СоСклада;
	// {{ПервыйБИТ ЛистТребований [22]  [AVZhelansky@1cbit.ru] [16.06.2024 10:00:00] Удаление типового кода - 		
	Если ВыполняетПеревозчик
		И ЗначениеЗаполнено(Объект.Перевозчик) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
			ЗаполнитьКонтрагентаИБанковскийСчетПеревозчика();
		КонецЕсли;
		
	
	Иначе
		// {{ПервыйБИТ ЛистТребований [22]  [AVZhelansky@1cbit.ru] [16.06.2024 10:00:00] Удаление типового кода + 	
		//Объект.Перевозчик = Справочники.Партнеры.ПустаяСсылка();
		// {{ПервыйБИТ ЛистТребований [22]  [AVZhelansky@1cbit.ru] [16.06.2024 10:00:00] Удаление типового кода - 	
		
		Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		Объект.БанковскийСчетПеревозчика = Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка();
		// {{ПервыйБИТ ЛистТребований [22]  [AVZhelansky@1cbit.ru] [16.06.2024 10:00:00] Удаление типового кода + 			
		//Перевозчик = Объект.Перевозчик; 
		// {{ПервыйБИТ ЛистТребований [22]  [AVZhelansky@1cbit.ru] [16.06.2024 10:00:00] Удаление типового кода - 	
		Перевозчик = Справочники.Партнеры.ПустаяСсылка();
	КонецЕсли;
	
	ЗаполнитьСпискиВыбораВодителейИТС();

КонецПроцедуры
#КонецОбласти
